Ran Plan for dir: `aws` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "/Users/ethan/.atlantis/bin/terraform1.6.6 plan -input=false -refresh -out \"/Users/ethan/.atlantis/repos/nursa-com/mage-ai-terraform-templates/5/default/aws/default.tfplan\"" in "/Users/ethan/.atlantis/repos/nursa-com/mage-ai-terraform-templates/5/default/aws": exit status 1
aws_iam_policy.mage_user_policy: Refreshing state... [id=arn:aws:iam::015782078654:policy/MageUserPolicy]
data.aws_secretsmanager_secret.db_credentials: Reading...
aws_iam_policy.secrets_read_only: Refreshing state... [id=arn:aws:iam::015782078654:policy/SecretsReadOnly]
aws_secretsmanager_secret.mage_user_secret_access_key_secret: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:015782078654:secret:dataeng-mage/prod/mage-user-access-key-secret-vmLwbR]
data.aws_subnet.subnet_1: Reading...
data.aws_iam_policy_document.assume_role_policy: Reading...
aws_cloudwatch_dashboard.iterable_mage_dashboard: Refreshing state... [id=iterable_mage_stats_tf]
aws_s3_bucket.bucket: Refreshing state... [id=mage-dataeng-prod]
aws_iam_user.mage_user: Refreshing state... [id=mage-user]
data.aws_secretsmanager_secret_version.whitelisted-ips: Reading...
data.aws_iam_policy_document.assume_role_policy: Read complete after 0s [id=320642683]
aws_cloudwatch_log_group.log-group: Refreshing state... [id=dataeng-mage-prod-logs]
data.aws_vpc.aws-vpc: Reading...
data.aws_secretsmanager_secret_version.whitelisted-ips: Read complete after 0s [id=dataeng/whitelisted-ips|AWSCURRENT]
data.aws_subnet.subnet_2: Reading...
data.aws_acm_certificate.cert: Reading...
aws_iam_policy.kinesis_access_policy: Refreshing state... [id=arn:aws:iam::015782078654:policy/KinesisAccessPolicy]
data.aws_route53_zone.nursa_dataeng: Reading...
aws_ecs_cluster.aws-ecs-cluster: Refreshing state... [id=arn:aws:ecs:us-west-2:015782078654:cluster/dataeng-mage-prod-cluster]
data.aws_subnet.subnet_1: Read complete after 0s [id=subnet-0b196fcc05bfd0b0b]
aws_efs_file_system.file_system: Refreshing state... [id=fs-0b28c84f6c0169cd6]
aws_iam_role.ecsTaskExecutionRole: Refreshing state... [id=dataeng-mage-execution-task-role]
aws_iam_access_key.mage_user_access_key: Refreshing state... [id=AKIAQHLFPNC7JHPPAW3B]
data.aws_subnet.subnet_2: Read complete after 0s [id=subnet-0ab32913852640bf3]
aws_iam_user_policy_attachment.attach_mage_user_policy: Refreshing state... [id=mage-user-20230901183434054600000002]
aws_elasticache_subnet_group.redis_subnet_group: Refreshing state... [id=dataeng-mage-prod-redis-subnet-group]
aws_db_subnet_group.rds_subnet_group: Refreshing state... [id=dataeng-mage-prod-rds-subnet-group]
aws_secretsmanager_secret_version.mage_user_access_key_secret_version: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:015782078654:secret:dataeng-mage/prod/mage-user-access-key-secret-vmLwbR|6C549106-6712-4492-9978-968022745D38]
aws_iam_role_policy_attachment.ecsTaskExecutionRole_policy: Refreshing state... [id=dataeng-mage-execution-task-role-20230714215543187000000003]
aws_iam_role_policy_attachment.attach_kinesis_policy: Refreshing state... [id=dataeng-mage-execution-task-role-20231129231721551600000001]
aws_iam_role_policy_attachment.attach_secrets_manager_policy: Refreshing state... [id=dataeng-mage-execution-task-role-20230901175747258100000001]
data.aws_acm_certificate.cert: Read complete after 0s [id=arn:aws:acm:us-west-2:015782078654:certificate/e3b72620-ed21-474e-aa74-1761285bf4fd]
data.aws_vpc.aws-vpc: Read complete after 0s [id=vpc-08fc24d82a6b7e3bc]
aws_security_group.bastion_sg: Refreshing state... [id=sg-0e0855e736aff7cdf]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:015782078654:targetgroup/dataeng-mage-prod-tg/125a14d728fa89fc]
aws_security_group.load_balancer_security_group: Refreshing state... [id=sg-0205b8917c0505e30]
aws_security_group.rds_bastion_sg: Refreshing state... [id=sg-0af94545c15447f6e]
aws_security_group.rds_ec2_connect_sg: Refreshing state... [id=sg-0929ae46ed3496ba3]
aws_security_group.service_security_group: Refreshing state... [id=sg-098902bc365450537]
aws_alb.application_load_balancer: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:015782078654:loadbalancer/app/dataeng-mage-prod-alb/cee94d77661e2679]
aws_instance.bastion: Refreshing state... [id=i-072f77feccbf23f61]
aws_security_group_rule.rds_bastion_sg_ingress: Refreshing state... [id=sgrule-1895348231]
aws_security_group_rule.rds_bastion_sg_egress: Refreshing state... [id=sgrule-2855428829]
aws_security_group.mount_target_security_group: Refreshing state... [id=sg-04b30fb8dc94256e8]
aws_iam_policy.mage_s3_bucket_policy: Refreshing state... [id=arn:aws:iam::015782078654:policy/MageS3BucketPolicy]
aws_security_group.redis_security_group: Refreshing state... [id=sg-037f0d173279104f4]
aws_security_group.rds_sg: Refreshing state... [id=sg-08b6d098299260dfe]
aws_efs_mount_target.mount_target[0]: Refreshing state... [id=fsmt-01d23b349c253bd07]
aws_efs_mount_target.mount_target[1]: Refreshing state... [id=fsmt-07809310c0ab735c2]
aws_elasticache_cluster.redis_cluster: Refreshing state... [id=dataeng-mage-prod-redis-cluster]
aws_iam_role_policy_attachment.attach_mage_s3_policy: Refreshing state... [id=dataeng-mage-execution-task-role-20230901181023960500000001]
aws_iam_user_policy_attachment.attach_mage_s3_bucket_policy: Refreshing state... [id=mage-user-20230901183433747400000001]
data.aws_route53_zone.nursa_dataeng: Read complete after 1s [id=Z01275071V4028FB3UXBQ]
aws_route53_record.mage_record: Refreshing state... [id=Z01275071V4028FB3UXBQ_mage.nursa-dataeng.com_A]
aws_lb_listener.https_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:015782078654:listener/app/dataeng-mage-prod-alb/cee94d77661e2679/7ffa9f7c4b6410bb]
aws_lb_listener.http_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:015782078654:listener/app/dataeng-mage-prod-alb/cee94d77661e2679/41b8e71754b6fc33]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # aws_alb.application_load_balancer must be replaced
-/+ resource "aws_alb" "application_load_balancer" {
      ~ arn                                         = "arn:aws:elasticloadbalancing:us-west-2:015782078654:loadbalancer/app/dataeng-mage-prod-alb/cee94d77661e2679" -> (known after apply)
      ~ arn_suffix                                  = "app/dataeng-mage-prod-alb/cee94d77661e2679" -> (known after apply)
      ~ dns_name                                    = "dataeng-mage-prod-alb-1479650377.us-west-2.elb.amazonaws.com" -> (known after apply)
      - enable_cross_zone_load_balancing            = true -> null
      ~ id                                          = "arn:aws:elasticloadbalancing:us-west-2:015782078654:loadbalancer/app/dataeng-mage-prod-alb/cee94d77661e2679" -> (known after apply)
      ~ ip_address_type                             = "ipv4" -> (known after apply)
      ~ name                                        = "dataeng-mage-prod-alb" -> "mage-data-prep-production-alb" # forces replacement
      ~ tags                                        = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          ~ "Name"        = "dataeng-mage-alb" -> "mage-data-prep-alb"
            "Owner"       = "data-engineering"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
        }
      ~ tags_all                                    = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          ~ "Name"        = "dataeng-mage-alb" -> "mage-data-prep-alb"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
            # (1 unchanged element hidden)
        }
      ~ vpc_id                                      = "vpc-08fc24d82a6b7e3bc" -> (known after apply)
      ~ zone_id                                     = "Z1H1FL5HABSF5" -> (known after apply)
        # (14 unchanged attributes hidden)

      - access_logs {
          - enabled = false -> null
        }

      - subnet_mapping {
          - subnet_id = "subnet-0ab32913852640bf3" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-0b196fcc05bfd0b0b" -> null
        }
    }

  # aws_cloudwatch_log_group.log-group must be replaced
-/+ resource "aws_cloudwatch_log_group" "log-group" {
      ~ arn               = "arn:aws:logs:us-west-2:015782078654:log-group:dataeng-mage-prod-logs" -> (known after apply)
      ~ id                = "dataeng-mage-prod-logs" -> (known after apply)
      ~ name              = "dataeng-mage-prod-logs" -> "mage-data-prep-production-logs" # forces replacement
      + name_prefix       = (known after apply)
      ~ tags              = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
            "Owner"       = "data-engineering"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
        }
      ~ tags_all          = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
            # (1 unchanged element hidden)
        }
        # (2 unchanged attributes hidden)
    }

  # aws_db_subnet_group.rds_subnet_group must be replaced
-/+ resource "aws_db_subnet_group" "rds_subnet_group" {
      ~ arn                     = "arn:aws:rds:us-west-2:015782078654:subgrp:dataeng-mage-prod-rds-subnet-group" -> (known after apply)
      ~ description             = "dataeng-mage RDS subnet group" -> "mage-data-prep RDS subnet group"
      ~ id                      = "dataeng-mage-prod-rds-subnet-group" -> (known after apply)
      ~ name                    = "dataeng-mage-prod-rds-subnet-group" -> "mage-data-prep-production-rds-subnet-group" # forces replacement
      + name_prefix             = (known after apply)
      ~ supported_network_types = [
          - "IPV4",
        ] -> (known after apply)
      ~ tags                    = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          ~ "Name"        = "dataeng-mage-prod-rds-subnet-group" -> "mage-data-prep-production-rds-subnet-group"
            "Owner"       = "data-engineering"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
        }
      ~ tags_all                = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          ~ "Name"        = "dataeng-mage-prod-rds-subnet-group" -> "mage-data-prep-production-rds-subnet-group"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
            # (1 unchanged element hidden)
        }
      ~ vpc_id                  = "vpc-08fc24d82a6b7e3bc" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_ecs_cluster.aws-ecs-cluster must be replaced
-/+ resource "aws_ecs_cluster" "aws-ecs-cluster" {
      ~ arn                = "arn:aws:ecs:us-west-2:015782078654:cluster/dataeng-mage-prod-cluster" -> (known after apply)
      ~ capacity_providers = [] -> (known after apply)
      ~ id                 = "arn:aws:ecs:us-west-2:015782078654:cluster/dataeng-mage-prod-cluster" -> (known after apply)
      ~ name               = "dataeng-mage-prod-cluster" -> "mage-data-prep-production-cluster" # forces replacement
      ~ tags               = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          ~ "Name"        = "dataeng-mage-ecs" -> "mage-data-prep-ecs"
            "Owner"       = "data-engineering"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
        }
      ~ tags_all           = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          ~ "Name"        = "dataeng-mage-ecs" -> "mage-data-prep-ecs"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
            # (1 unchanged element hidden)
        }

        # (1 unchanged block hidden)
    }

  # aws_efs_file_system.file_system will be updated in-place
  ~ resource "aws_efs_file_system" "file_system" {
        id                              = "fs-0b28c84f6c0169cd6"
      ~ tags                            = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          ~ "Name"        = "dataeng-mage-efs" -> "mage-data-prep-efs"
            "Owner"       = "data-engineering"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
        }
      ~ tags_all                        = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          ~ "Name"        = "dataeng-mage-efs" -> "mage-data-prep-efs"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
            # (1 unchanged element hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # aws_elasticache_cluster.redis_cluster must be replaced
-/+ resource "aws_elasticache_cluster" "redis_cluster" {
      ~ arn                        = "arn:aws:elasticache:us-west-2:015782078654:cluster:dataeng-mage-prod-redis-cluster" -> (known after apply)
      ~ availability_zone          = "us-west-2a" -> (known after apply)
      ~ az_mode                    = "single-az" -> (known after apply)
      ~ cache_nodes                = [
          - {
              - address           = "dataeng-mage-prod-redis-cluster.dq6ohy.0001.usw2.cache.amazonaws.com"
              - availability_zone = "us-west-2a"
              - id                = "0001"
              - outpost_arn       = ""
              - port              = 6379
            },
        ] -> (known after apply)
      + cluster_address            = (known after apply)
      ~ cluster_id                 = "dataeng-mage-prod-redis-cluster" -> "mage-data-prep-production-redis-cluster" # forces replacement
      + configuration_endpoint     = (known after apply)
      ~ engine_version_actual      = "7.1.0" -> (known after apply)
      ~ id                         = "dataeng-mage-prod-redis-cluster" -> (known after apply)
      ~ ip_discovery               = "ipv4" -> (known after apply)
      ~ maintenance_window         = "mon:11:00-mon:12:00" -> (known after apply)
      ~ network_type               = "ipv4" -> (known after apply)
      ~ parameter_group_name       = "default.redis7" -> (known after apply)
      + preferred_outpost_arn      = (known after apply)
      + replication_group_id       = (known after apply)
      ~ security_group_ids         = [
          - "sg-037f0d173279104f4",
        ] -> (known after apply)
      ~ security_group_names       = [] -> (known after apply)
      - snapshot_retention_limit   = 0 -> null
      ~ snapshot_window            = "09:00-10:00" -> (known after apply)
      ~ subnet_group_name          = "dataeng-mage-prod-redis-subnet-group" -> "mage-data-prep-production-redis-subnet-group" # forces replacement
      ~ tags                       = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          ~ "Name"        = "dataeng-mage-prod-redis-cluster" -> "mage-data-prep-production-redis-cluster"
            "Owner"       = "data-engineering"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
        }
      ~ tags_all                   = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          ~ "Name"        = "dataeng-mage-prod-redis-cluster" -> "mage-data-prep-production-redis-cluster"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
            # (1 unchanged element hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # aws_elasticache_subnet_group.redis_subnet_group must be replaced
-/+ resource "aws_elasticache_subnet_group" "redis_subnet_group" {
      ~ arn         = "arn:aws:elasticache:us-west-2:015782078654:subnetgroup:dataeng-mage-prod-redis-subnet-group" -> (known after apply)
      ~ id          = "dataeng-mage-prod-redis-subnet-group" -> (known after apply)
      ~ name        = "dataeng-mage-prod-redis-subnet-group" -> "mage-data-prep-production-redis-subnet-group" # forces replacement
      ~ tags        = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          ~ "Name"        = "dataeng-mage-prod-redis-subnet-group" -> "mage-data-prep-production-redis-subnet-group"
            "Owner"       = "data-engineering"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
        }
      ~ tags_all    = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          ~ "Name"        = "dataeng-mage-prod-redis-subnet-group" -> "mage-data-prep-production-redis-subnet-group"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
            # (1 unchanged element hidden)
        }
        # (2 unchanged attributes hidden)
    }

  # aws_iam_policy.mage_s3_bucket_policy will be updated in-place
  ~ resource "aws_iam_policy" "mage_s3_bucket_policy" {
        id          = "arn:aws:iam::015782078654:policy/MageS3BucketPolicy"
        name        = "MageS3BucketPolicy"
      ~ tags        = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          ~ "Name"        = "dataeng-mage-mage-s3-bucket-policy" -> "mage-data-prep-mage-s3-bucket-policy"
            "Owner"       = "data-engineering"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
        }
      ~ tags_all    = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          ~ "Name"        = "dataeng-mage-mage-s3-bucket-policy" -> "mage-data-prep-mage-s3-bucket-policy"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # aws_iam_policy.mage_user_policy will be updated in-place
  ~ resource "aws_iam_policy" "mage_user_policy" {
        id          = "arn:aws:iam::015782078654:policy/MageUserPolicy"
        name        = "MageUserPolicy"
      ~ tags        = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          ~ "Name"        = "dataeng-mage-mage-user-policy" -> "mage-data-prep-mage-user-policy"
            "Owner"       = "data-engineering"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
        }
      ~ tags_all    = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          ~ "Name"        = "dataeng-mage-mage-user-policy" -> "mage-data-prep-mage-user-policy"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # aws_iam_policy.secrets_read_only will be updated in-place
  ~ resource "aws_iam_policy" "secrets_read_only" {
        id          = "arn:aws:iam::015782078654:policy/SecretsReadOnly"
        name        = "SecretsReadOnly"
      ~ tags        = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          ~ "Name"        = "dataeng-mage-secrets-read-only" -> "mage-data-prep-secrets-read-only"
            "Owner"       = "data-engineering"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
        }
      ~ tags_all    = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          ~ "Name"        = "dataeng-mage-secrets-read-only" -> "mage-data-prep-secrets-read-only"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # aws_iam_role.ecsTaskExecutionRole must be replaced
-/+ resource "aws_iam_role" "ecsTaskExecutionRole" {
      ~ arn                   = "arn:aws:iam::015782078654:role/dataeng-mage-execution-task-role" -> (known after apply)
      ~ create_date           = "2023-07-14T21:55:42Z" -> (known after apply)
      ~ id                    = "dataeng-mage-execution-task-role" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::015782078654:policy/KinesisAccessPolicy",
          - "arn:aws:iam::015782078654:policy/MageS3BucketPolicy",
          - "arn:aws:iam::015782078654:policy/SecretsReadOnly",
          - "arn:aws:iam::aws:policy/AmazonKinesisAnalyticsFullAccess",
          - "arn:aws:iam::aws:policy/AmazonKinesisFullAccess",
          - "arn:aws:iam::aws:policy/AmazonRedshiftFullAccess",
          - "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role",
        ] -> (known after apply)
      ~ name                  = "dataeng-mage-execution-task-role" -> "mage-data-prep-execution-task-role" # forces replacement
      + name_prefix           = (known after apply)
      ~ role_last_used        = [
          - {
              - last_used_date = "2023-12-13T22:31:16Z"
              - region         = "us-west-2"
            },
        ] -> (known after apply)
      ~ tags                  = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          ~ "Name"        = "dataeng-mage-iam-role" -> "mage-data-prep-iam-role"
            "Owner"       = "data-engineering"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
        }
      ~ tags_all              = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          ~ "Name"        = "dataeng-mage-iam-role" -> "mage-data-prep-iam-role"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
            # (1 unchanged element hidden)
        }
      ~ unique_id             = "AROAQHLFPNC7OEGPDDUIR" -> (known after apply)
        # (4 unchanged attributes hidden)

      - inline_policy {
          - name   = "ElastiCacheFullAccess" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = "elasticache:*"
                          - Effect   = "Allow"
                          - Resource = "*"
                          - Sid      = "VisualEditor0"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role_policy_attachment.attach_kinesis_policy must be replaced
-/+ resource "aws_iam_role_policy_attachment" "attach_kinesis_policy" {
      ~ id         = "dataeng-mage-execution-task-role-20231129231721551600000001" -> (known after apply)
      ~ role       = "dataeng-mage-execution-task-role" -> "mage-data-prep-execution-task-role" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy_attachment.attach_mage_s3_policy must be replaced
-/+ resource "aws_iam_role_policy_attachment" "attach_mage_s3_policy" {
      ~ id         = "dataeng-mage-execution-task-role-20230901181023960500000001" -> (known after apply)
      ~ role       = "dataeng-mage-execution-task-role" -> "mage-data-prep-execution-task-role" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy_attachment.attach_secrets_manager_policy must be replaced
-/+ resource "aws_iam_role_policy_attachment" "attach_secrets_manager_policy" {
      ~ id         = "dataeng-mage-execution-task-role-20230901175747258100000001" -> (known after apply)
      ~ role       = "dataeng-mage-execution-task-role" -> "mage-data-prep-execution-task-role" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy_attachment.ecsTaskExecutionRole_policy must be replaced
-/+ resource "aws_iam_role_policy_attachment" "ecsTaskExecutionRole_policy" {
      ~ id         = "dataeng-mage-execution-task-role-20230714215543187000000003" -> (known after apply)
      ~ role       = "dataeng-mage-execution-task-role" -> "mage-data-prep-execution-task-role" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_iam_user.mage_user will be updated in-place
  ~ resource "aws_iam_user" "mage_user" {
        id            = "mage-user"
        name          = "mage-user"
      ~ tags          = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          ~ "Name"        = "dataeng-mage-mage-user" -> "mage-data-prep-mage-user"
            "Owner"       = "data-engineering"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
        }
      ~ tags_all      = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          ~ "Name"        = "dataeng-mage-mage-user" -> "mage-data-prep-mage-user"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
            # (1 unchanged element hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # aws_instance.bastion will be updated in-place
  ~ resource "aws_instance" "bastion" {
        id                                   = "i-072f77feccbf23f61"
      ~ tags                                 = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
            "Name"        = "dataeng-mage-prod-bastion"
            "Owner"       = "data-engineering"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
        }
      ~ tags_all                             = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
            # (2 unchanged elements hidden)
        }
      ~ vpc_security_group_ids               = [
          - "sg-0af94545c15447f6e",
          - "sg-0e0855e736aff7cdf",
        ] -> (known after apply)
        # (30 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # aws_lb_listener.http_listener must be replaced
-/+ resource "aws_lb_listener" "http_listener" {
      ~ arn               = "arn:aws:elasticloadbalancing:us-west-2:015782078654:listener/app/dataeng-mage-prod-alb/cee94d77661e2679/41b8e71754b6fc33" -> (known after apply)
      ~ id                = "arn:aws:elasticloadbalancing:us-west-2:015782078654:listener/app/dataeng-mage-prod-alb/cee94d77661e2679/41b8e71754b6fc33" -> (known after apply)
      ~ load_balancer_arn = "arn:aws:elasticloadbalancing:us-west-2:015782078654:loadbalancer/app/dataeng-mage-prod-alb/cee94d77661e2679" # forces replacement -> (known after apply) # forces replacement
      + ssl_policy        = (known after apply)
      ~ tags              = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          ~ "Name"        = "dataeng-mage-lb-http_listener" -> "mage-data-prep-lb-http_listener"
            "Owner"       = "data-engineering"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
        }
      ~ tags_all          = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          ~ "Name"        = "dataeng-mage-lb-http_listener" -> "mage-data-prep-lb-http_listener"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
            # (1 unchanged element hidden)
        }
        # (2 unchanged attributes hidden)

      ~ default_action {
          ~ order = 1 -> (known after apply)
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }
    }

  # aws_lb_listener.https_listener must be replaced
-/+ resource "aws_lb_listener" "https_listener" {
      ~ arn               = "arn:aws:elasticloadbalancing:us-west-2:015782078654:listener/app/dataeng-mage-prod-alb/cee94d77661e2679/7ffa9f7c4b6410bb" -> (known after apply)
      ~ id                = "arn:aws:elasticloadbalancing:us-west-2:015782078654:listener/app/dataeng-mage-prod-alb/cee94d77661e2679/7ffa9f7c4b6410bb" -> (known after apply)
      ~ load_balancer_arn = "arn:aws:elasticloadbalancing:us-west-2:015782078654:loadbalancer/app/dataeng-mage-prod-alb/cee94d77661e2679" # forces replacement -> (known after apply) # forces replacement
      ~ tags              = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          ~ "Name"        = "dataeng-mage-lb-https_listener" -> "mage-data-prep-lb-https_listener"
            "Owner"       = "data-engineering"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
        }
      ~ tags_all          = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          ~ "Name"        = "dataeng-mage-lb-https_listener" -> "mage-data-prep-lb-https_listener"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
            # (1 unchanged element hidden)
        }
        # (4 unchanged attributes hidden)

      ~ default_action {
          ~ order            = 1 -> (known after apply)
          ~ target_group_arn = "arn:aws:elasticloadbalancing:us-west-2:015782078654:targetgroup/dataeng-mage-prod-tg/125a14d728fa89fc" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # aws_lb_target_group.target_group must be replaced
-/+ resource "aws_lb_target_group" "target_group" {
      ~ arn                                = "arn:aws:elasticloadbalancing:us-west-2:015782078654:targetgroup/dataeng-mage-prod-tg/125a14d728fa89fc" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/dataeng-mage-prod-tg/125a14d728fa89fc" -> (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:us-west-2:015782078654:targetgroup/dataeng-mage-prod-tg/125a14d728fa89fc" -> (known after apply)
      ~ ip_address_type                    = "ipv4" -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
      ~ load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> (known after apply)
      ~ name                               = "dataeng-mage-prod-tg" -> "mage-data-prep-production-tg" # forces replacement
      + preserve_client_ip                 = (known after apply)
      ~ protocol_version                   = "HTTP1" -> (known after apply)
      ~ tags                               = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          ~ "Name"        = "dataeng-mage-lb-tg" -> "mage-data-prep-lb-tg"
            "Owner"       = "data-engineering"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
        }
      ~ tags_all                           = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          ~ "Name"        = "dataeng-mage-lb-tg" -> "mage-data-prep-lb-tg"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
            # (1 unchanged element hidden)
        }
        # (9 unchanged attributes hidden)

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
        }

      - target_failover {}

        # (1 unchanged block hidden)
    }

  # aws_route53_record.mage_record will be updated in-place
  ~ resource "aws_route53_record" "mage_record" {
        id                               = "Z01275071V4028FB3UXBQ_mage.nursa-dataeng.com_A"
        name                             = "mage.nursa-dataeng.com"
        # (6 unchanged attributes hidden)

      ~ alias {
          ~ name                   = "dataeng-mage-prod-alb-1479650377.us-west-2.elb.amazonaws.com" -> (known after apply)
          ~ zone_id                = "Z1H1FL5HABSF5" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # aws_s3_bucket.bucket will be updated in-place
  ~ resource "aws_s3_bucket" "bucket" {
        id                          = "mage-dataeng-prod"
      ~ tags                        = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          ~ "Name"        = "dataeng-mage-s3-bucket" -> "mage-data-prep-s3-bucket"
            "Owner"       = "data-engineering"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
        }
      ~ tags_all                    = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          ~ "Name"        = "dataeng-mage-s3-bucket" -> "mage-data-prep-s3-bucket"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
            # (1 unchanged element hidden)
        }
        # (9 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_secretsmanager_secret.mage_user_secret_access_key_secret must be replaced
-/+ resource "aws_secretsmanager_secret" "mage_user_secret_access_key_secret" {
      ~ arn                            = "arn:aws:secretsmanager:us-west-2:015782078654:secret:dataeng-mage/prod/mage-user-access-key-secret-vmLwbR" -> (known after apply)
      ~ id                             = "arn:aws:secretsmanager:us-west-2:015782078654:secret:dataeng-mage/prod/mage-user-access-key-secret-vmLwbR" -> (known after apply)
      ~ name                           = "dataeng-mage/prod/mage-user-access-key-secret" -> "mage-data-prep/production/mage-user-access-key-secret" # forces replacement
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      ~ rotation_enabled               = false -> (known after apply)
      + rotation_lambda_arn            = (known after apply)
      ~ tags                           = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          ~ "Name"        = "dataeng-mage-mage-user-access-key-secret-version" -> "mage-data-prep-mage-user-access-key-secret-version"
            "Owner"       = "data-engineering"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
        }
      ~ tags_all                       = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          ~ "Name"        = "dataeng-mage-mage-user-access-key-secret-version" -> "mage-data-prep-mage-user-access-key-secret-version"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
            # (1 unchanged element hidden)
        }
        # (2 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret_version.mage_user_access_key_secret_version must be replaced
-/+ resource "aws_secretsmanager_secret_version" "mage_user_access_key_secret_version" {
      ~ arn            = "arn:aws:secretsmanager:us-west-2:015782078654:secret:dataeng-mage/prod/mage-user-access-key-secret-vmLwbR" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:us-west-2:015782078654:secret:dataeng-mage/prod/mage-user-access-key-secret-vmLwbR|6C549106-6712-4492-9978-968022745D38" -> (known after apply)
      ~ secret_id      = "arn:aws:secretsmanager:us-west-2:015782078654:secret:dataeng-mage/prod/mage-user-access-key-secret-vmLwbR" # forces replacement -> (known after apply) # forces replacement
      ~ version_id     = "6C549106-6712-4492-9978-968022745D38" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_security_group.bastion_sg must be replaced
-/+ resource "aws_security_group" "bastion_sg" {
      ~ arn                    = "arn:aws:ec2:us-west-2:015782078654:security-group/sg-0e0855e736aff7cdf" -> (known after apply)
      ~ id                     = "sg-0e0855e736aff7cdf" -> (known after apply)
      ~ name                   = "dataeng-mage-prod-bastion-sg" -> "mage-data-prep-production-bastion-sg" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "015782078654" -> (known after apply)
      ~ tags                   = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          ~ "Name"        = "dataeng-mage-prod-bastion-sg" -> "mage-data-prep-production-bastion-sg"
            "Owner"       = "data-engineering"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
        }
      ~ tags_all               = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          ~ "Name"        = "dataeng-mage-prod-bastion-sg" -> "mage-data-prep-production-bastion-sg"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # aws_security_group.load_balancer_security_group will be updated in-place
  ~ resource "aws_security_group" "load_balancer_security_group" {
        id                     = "sg-0205b8917c0505e30"
        name                   = "terraform-20230714215542772800000002"
      ~ tags                   = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          ~ "Name"        = "dataeng-mage-sg" -> "mage-data-prep-sg"
            "Owner"       = "data-engineering"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
        }
      ~ tags_all               = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          ~ "Name"        = "dataeng-mage-sg" -> "mage-data-prep-sg"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
            # (1 unchanged element hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # aws_security_group.mount_target_security_group will be updated in-place
  ~ resource "aws_security_group" "mount_target_security_group" {
        id                     = "sg-04b30fb8dc94256e8"
        name                   = "terraform-20230714215547375400000006"
      ~ tags                   = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          ~ "Name"        = "dataeng-mage-efs-sg" -> "mage-data-prep-efs-sg"
            "Owner"       = "data-engineering"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
        }
      ~ tags_all               = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          ~ "Name"        = "dataeng-mage-efs-sg" -> "mage-data-prep-efs-sg"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
            # (1 unchanged element hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # aws_security_group.rds_bastion_sg must be replaced
-/+ resource "aws_security_group" "rds_bastion_sg" {
      ~ arn                    = "arn:aws:ec2:us-west-2:015782078654:security-group/sg-0af94545c15447f6e" -> (known after apply)
      ~ egress                 = [
          - {
              - cidr_blocks      = []
              - description      = "Rule to allow connections to dataeng-mage-prod-db from any instances this security group is attached to"
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0929ae46ed3496ba3",
                ]
              - self             = false
              - to_port          = 5432
            },
        ] -> (known after apply)
      ~ id                     = "sg-0af94545c15447f6e" -> (known after apply)
      ~ ingress                = [] -> (known after apply)
      ~ name                   = "dataeng-mage-prod-rds-bastion-sg" -> "mage-data-prep-production-rds-bastion-sg" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "015782078654" -> (known after apply)
      ~ tags                   = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          ~ "Name"        = "dataeng-mage-prod-rds-bastion-sg" -> "mage-data-prep-production-rds-bastion-sg"
            "Owner"       = "data-engineering"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
        }
      ~ tags_all               = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          ~ "Name"        = "dataeng-mage-prod-rds-bastion-sg" -> "mage-data-prep-production-rds-bastion-sg"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
            # (1 unchanged element hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # aws_security_group.rds_ec2_connect_sg must be replaced
-/+ resource "aws_security_group" "rds_ec2_connect_sg" {
      ~ arn                    = "arn:aws:ec2:us-west-2:015782078654:security-group/sg-0929ae46ed3496ba3" -> (known after apply)
      ~ egress                 = [] -> (known after apply)
      ~ id                     = "sg-0929ae46ed3496ba3" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Rule to allow connections from EC2 instances with sg-009b7ae4a245358f2 attached"
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0af94545c15447f6e",
                ]
              - self             = false
              - to_port          = 5432
            },
        ] -> (known after apply)
      ~ name                   = "dataeng-mage-prod-rds-ec2-connect-sg" -> "mage-data-prep-production-rds-ec2-connect-sg" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "015782078654" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_security_group.rds_sg must be replaced
-/+ resource "aws_security_group" "rds_sg" {
      ~ arn                    = "arn:aws:ec2:us-west-2:015782078654:security-group/sg-08b6d098299260dfe" -> (known after apply)
      ~ description            = "dataeng-mage RDS Security Group" -> "mage-data-prep RDS Security Group" # forces replacement
      ~ id                     = "sg-08b6d098299260dfe" -> (known after apply)
      ~ name                   = "dataeng-mage-prod-rds-sg" -> "mage-data-prep-production-rds-sg" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "015782078654" -> (known after apply)
      ~ tags                   = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          ~ "Name"        = "dataeng-mage-prod-rds-sg" -> "mage-data-prep-production-rds-sg"
            "Owner"       = "data-engineering"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
        }
      ~ tags_all               = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          ~ "Name"        = "dataeng-mage-prod-rds-sg" -> "mage-data-prep-production-rds-sg"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
            # (1 unchanged element hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # aws_security_group.redis_security_group must be replaced
-/+ resource "aws_security_group" "redis_security_group" {
      ~ arn                    = "arn:aws:ec2:us-west-2:015782078654:security-group/sg-037f0d173279104f4" -> (known after apply)
      ~ id                     = "sg-037f0d173279104f4" -> (known after apply)
      ~ name                   = "dataeng-mage-prod-redis-sg" -> "mage-data-prep-production-redis-sg" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "015782078654" -> (known after apply)
      ~ tags                   = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          ~ "Name"        = "dataeng-mage-redis-sg" -> "mage-data-prep-redis-sg"
            "Owner"       = "data-engineering"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
        }
      ~ tags_all               = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          ~ "Name"        = "dataeng-mage-redis-sg" -> "mage-data-prep-redis-sg"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # aws_security_group.service_security_group will be updated in-place
  ~ resource "aws_security_group" "service_security_group" {
        id                     = "sg-098902bc365450537"
        name                   = "terraform-20230714215545118400000005"
      ~ tags                   = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          ~ "Name"        = "dataeng-mage-service-sg" -> "mage-data-prep-service-sg"
            "Owner"       = "data-engineering"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
        }
      ~ tags_all               = {
          - "Env"         = "prod" -> null
          + "Environment" = "prod"
          ~ "ManagedBy"   = "terraform" -> "Terraform"
          ~ "Name"        = "dataeng-mage-service-sg" -> "mage-data-prep-service-sg"
          - "Repo"        = "nursa-com/mage-ai-terraform-templates" -> null
          - "Service"     = "mage" -> null
            # (1 unchanged element hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # aws_security_group_rule.rds_bastion_sg_egress must be replaced
-/+ resource "aws_security_group_rule" "rds_bastion_sg_egress" {
      ~ id                       = "sgrule-2855428829" -> (known after apply)
      ~ security_group_id        = "sg-0af94545c15447f6e" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-05b4b52ffa9efdb10" -> (known after apply)
      ~ source_security_group_id = "sg-0929ae46ed3496ba3" # forces replacement -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # aws_security_group_rule.rds_bastion_sg_ingress must be replaced
-/+ resource "aws_security_group_rule" "rds_bastion_sg_ingress" {
      ~ id                       = "sgrule-1895348231" -> (known after apply)
      ~ security_group_id        = "sg-0929ae46ed3496ba3" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-061ab72c2f1d83ed8" -> (known after apply)
      ~ source_security_group_id = "sg-0af94545c15447f6e" # forces replacement -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)
    }

Plan: 23 to add, 11 to change, 23 to destroy.

Changes to Outputs:
  ~ redis_endpoint = "dataeng-mage-prod-redis-cluster.dq6ohy.0001.usw2.cache.amazonaws.com" -> (known after apply)
╷
│ Error: Secrets Manager Secret "mage-data-prep/production/rds-db-creds" not found
│ 
│   with data.aws_secretsmanager_secret.db_credentials,
│   on db.tf line 53, in data "aws_secretsmanager_secret" "db_credentials":
│   53: data "aws_secretsmanager_secret" "db_credentials" {
│ 
╵

```
</details>